# CannotCopyFromMultipleLinks Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CuttingFailures..::..CannotCopyFromMultipleLinks Property
BuiltInFailures..::..CuttingFailures Class See Also
---
Elements cannot be copied from multiple links at the same time.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyFromMultipleLinks { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyFromMultipleLinks As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyFromMultipleLinks {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CuttingFailures Class
Autodesk.Revit.DB Namespace